Revit 2027 API
ConicalSurface.IsValidConeAngle Method
 Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidConeAngle(
	double halfAngle
)
Public Shared Function IsValidConeAngle (
	halfAngle As Double
) As Boolean
public:
static bool IsValidConeAngle(
	double halfAngle
)
static member IsValidConeAngle :
        halfAngle : float -> bool
Parameters
halfAngle Double
 Cone half-angle parameter.
Return Value
Boolean
 True if input is not 0, lesser than PI/2 and greater than -PI/2, false otherwise.
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace